grevaillot/svd_tools/headers/STM32H7x7_CM4/dfsdm.h
#pragma once 

/* --- DFSDM: Digital filter for sigma delta modulators ------------- */

/** @defgroup dfsdm_registers Digital filter for sigma delta
      modulators Register
@{*/

/** DFSDM_CH0CFGR1 channel configuration y register **/
#define DFSDM_CH0CFGR1			MMIO32(DFSDM_BASE + 0x00)
/** DFSDM_CH0CFGR2 channel configuration y register **/
#define DFSDM_CH0CFGR2			MMIO32(DFSDM_BASE + 0x04)
/** DFSDM_CH0AWSCDR analog watchdog and short-circuit detector register **/
#define DFSDM_CH0AWSCDR			MMIO32(DFSDM_BASE + 0x08)
/** DFSDM_CH0WDATR channel watchdog filter data register **/
#define DFSDM_CH0WDATR			MMIO32(DFSDM_BASE + 0x0c)
/** DFSDM_CH0DATINR channel data input register **/
#define DFSDM_CH0DATINR			MMIO32(DFSDM_BASE + 0x10)
/** DFSDM_CH1CFGR1 CHCFG1R1 **/
#define DFSDM_CH1CFGR1			MMIO32(DFSDM_BASE + 0x20)
/** DFSDM_CH1CFGR2 CHCFG1R2 **/
#define DFSDM_CH1CFGR2			MMIO32(DFSDM_BASE + 0x24)
/** DFSDM_CH1AWSCDR AWSCD1R **/
#define DFSDM_CH1AWSCDR			MMIO32(DFSDM_BASE + 0x28)
/** DFSDM_CH1WDATR CHWDAT1R **/
#define DFSDM_CH1WDATR			MMIO32(DFSDM_BASE + 0x2c)
/** DFSDM_CH1DATINR CHDATIN1R **/
#define DFSDM_CH1DATINR			MMIO32(DFSDM_BASE + 0x30)
/** DFSDM_CH2CFGR1 CHCFG2R1 **/
#define DFSDM_CH2CFGR1			MMIO32(DFSDM_BASE + 0x40)
/** DFSDM_CH2CFGR2 CHCFG2R2 **/
#define DFSDM_CH2CFGR2			MMIO32(DFSDM_BASE + 0x44)
/** DFSDM_CH2AWSCDR AWSCD2R **/
#define DFSDM_CH2AWSCDR			MMIO32(DFSDM_BASE + 0x48)
/** DFSDM_CH2WDATR CHWDAT2R **/
#define DFSDM_CH2WDATR			MMIO32(DFSDM_BASE + 0x4c)
/** DFSDM_CH2DATINR CHDATIN2R **/
#define DFSDM_CH2DATINR			MMIO32(DFSDM_BASE + 0x50)
/** DFSDM_CH3CFGR1 CHCFG3R1 **/
#define DFSDM_CH3CFGR1			MMIO32(DFSDM_BASE + 0x60)
/** DFSDM_CH3CFGR2 CHCFG3R2 **/
#define DFSDM_CH3CFGR2			MMIO32(DFSDM_BASE + 0x64)
/** DFSDM_CH3AWSCDR AWSCD3R **/
#define DFSDM_CH3AWSCDR			MMIO32(DFSDM_BASE + 0x68)
/** DFSDM_CH3WDATR CHWDAT3R **/
#define DFSDM_CH3WDATR			MMIO32(DFSDM_BASE + 0x6c)
/** DFSDM_CH3DATINR CHDATIN3R **/
#define DFSDM_CH3DATINR			MMIO32(DFSDM_BASE + 0x70)
/** DFSDM_CH4CFGR1 CHCFG4R1 **/
#define DFSDM_CH4CFGR1			MMIO32(DFSDM_BASE + 0x80)
/** DFSDM_CH4CFGR2 CHCFG4R2 **/
#define DFSDM_CH4CFGR2			MMIO32(DFSDM_BASE + 0x84)
/** DFSDM_CH4AWSCDR AWSCD4R **/
#define DFSDM_CH4AWSCDR			MMIO32(DFSDM_BASE + 0x88)
/** DFSDM_CH4WDATR CHWDAT4R **/
#define DFSDM_CH4WDATR			MMIO32(DFSDM_BASE + 0x8c)
/** DFSDM_CH4DATINR CHDATIN4R **/
#define DFSDM_CH4DATINR			MMIO32(DFSDM_BASE + 0x90)
/** DFSDM_CH5CFGR1 CHCFG5R1 **/
#define DFSDM_CH5CFGR1			MMIO32(DFSDM_BASE + 0xa0)
/** DFSDM_CH5CFGR2 CHCFG5R2 **/
#define DFSDM_CH5CFGR2			MMIO32(DFSDM_BASE + 0xa4)
/** DFSDM_CH5AWSCDR AWSCD5R **/
#define DFSDM_CH5AWSCDR			MMIO32(DFSDM_BASE + 0xa8)
/** DFSDM_CH5WDATR CHWDAT5R **/
#define DFSDM_CH5WDATR			MMIO32(DFSDM_BASE + 0xac)
/** DFSDM_CH5DATINR CHDATIN5R **/
#define DFSDM_CH5DATINR			MMIO32(DFSDM_BASE + 0xb0)
/** DFSDM_CH6CFGR1 CHCFG6R1 **/
#define DFSDM_CH6CFGR1			MMIO32(DFSDM_BASE + 0xc0)
/** DFSDM_CH6CFGR2 CH6CFGR2 **/
#define DFSDM_CH6CFGR2			MMIO32(DFSDM_BASE + 0xc4)
/** DFSDM_CH6AWSCDR AWSCD6R **/
#define DFSDM_CH6AWSCDR			MMIO32(DFSDM_BASE + 0xc8)
/** DFSDM_CH6WDATR CHWDAT6R **/
#define DFSDM_CH6WDATR			MMIO32(DFSDM_BASE + 0xcc)
/** DFSDM_CH6DATINR CHDATIN6R **/
#define DFSDM_CH6DATINR			MMIO32(DFSDM_BASE + 0xd0)
/** DFSDM_CH7CFGR1 CHCFG7R1 **/
#define DFSDM_CH7CFGR1			MMIO32(DFSDM_BASE + 0xe0)
/** DFSDM_CH7CFGR2 CHCFG7R2 **/
#define DFSDM_CH7CFGR2			MMIO32(DFSDM_BASE + 0xe4)
/** DFSDM_CH7AWSCDR AWSCD7R **/
#define DFSDM_CH7AWSCDR			MMIO32(DFSDM_BASE + 0xe8)
/** DFSDM_CH7WDATR CHWDAT7R **/
#define DFSDM_CH7WDATR			MMIO32(DFSDM_BASE + 0xec)
/** DFSDM_CH7DATINR CHDATIN7R **/
#define DFSDM_CH7DATINR			MMIO32(DFSDM_BASE + 0xf0)
/** DFSDM_FLT0CR1 control register 1 **/
#define DFSDM_FLT0CR1			MMIO32(DFSDM_BASE + 0x100)
/** DFSDM_FLT0CR2 control register 2 **/
#define DFSDM_FLT0CR2			MMIO32(DFSDM_BASE + 0x104)
/** DFSDM_FLT0ISR interrupt and status register **/
#define DFSDM_FLT0ISR			MMIO32(DFSDM_BASE + 0x108)
/** DFSDM_FLT0ICR interrupt flag clear register **/
#define DFSDM_FLT0ICR			MMIO32(DFSDM_BASE + 0x10c)
/** DFSDM_FLT0JCHGR injected channel group selection register **/
#define DFSDM_FLT0JCHGR			MMIO32(DFSDM_BASE + 0x110)
/** DFSDM_FLT0FCR filter control register **/
#define DFSDM_FLT0FCR			MMIO32(DFSDM_BASE + 0x114)
/** DFSDM_FLT0JDATAR data register for injected group **/
#define DFSDM_FLT0JDATAR			MMIO32(DFSDM_BASE + 0x118)
/** DFSDM_FLT0RDATAR data register for the regular channel **/
#define DFSDM_FLT0RDATAR			MMIO32(DFSDM_BASE + 0x11c)
/** DFSDM_FLT0AWHTR analog watchdog high threshold register **/
#define DFSDM_FLT0AWHTR			MMIO32(DFSDM_BASE + 0x120)
/** DFSDM_FLT0AWLTR analog watchdog low threshold register **/
#define DFSDM_FLT0AWLTR			MMIO32(DFSDM_BASE + 0x124)
/** DFSDM_FLT0AWSR analog watchdog status register **/
#define DFSDM_FLT0AWSR			MMIO32(DFSDM_BASE + 0x128)
/** DFSDM_FLT0AWCFR analog watchdog clear flag register **/
#define DFSDM_FLT0AWCFR			MMIO32(DFSDM_BASE + 0x12c)
/** DFSDM_FLT0EXMAX Extremes detector maximum register **/
#define DFSDM_FLT0EXMAX			MMIO32(DFSDM_BASE + 0x130)
/** DFSDM_FLT0EXMIN Extremes detector minimum register **/
#define DFSDM_FLT0EXMIN			MMIO32(DFSDM_BASE + 0x134)
/** DFSDM_FLT0CNVTIMR conversion timer register **/
#define DFSDM_FLT0CNVTIMR			MMIO32(DFSDM_BASE + 0x138)
/** DFSDM_FLT1CR1 control register 1 **/
#define DFSDM_FLT1CR1			MMIO32(DFSDM_BASE + 0x180)
/** DFSDM_FLT1CR2 control register 2 **/
#define DFSDM_FLT1CR2			MMIO32(DFSDM_BASE + 0x184)
/** DFSDM_FLT1ISR interrupt and status register **/
#define DFSDM_FLT1ISR			MMIO32(DFSDM_BASE + 0x188)
/** DFSDM_FLT1ICR interrupt flag clear register **/
#define DFSDM_FLT1ICR			MMIO32(DFSDM_BASE + 0x18c)
/** DFSDM_FLT1JCHGR injected channel group selection register **/
#define DFSDM_FLT1JCHGR			MMIO32(DFSDM_BASE + 0x190)
/** DFSDM_FLT1FCR filter control register **/
#define DFSDM_FLT1FCR			MMIO32(DFSDM_BASE + 0x194)
/** DFSDM_FLT1JDATAR data register for injected group **/
#define DFSDM_FLT1JDATAR			MMIO32(DFSDM_BASE + 0x198)
/** DFSDM_FLT1RDATAR data register for the regular channel **/
#define DFSDM_FLT1RDATAR			MMIO32(DFSDM_BASE + 0x19c)
/** DFSDM_FLT1AWLTR analog watchdog low threshold register **/
#define DFSDM_FLT1AWLTR			MMIO32(DFSDM_BASE + 0x1a4)
/** DFSDM_FLT1AWSR analog watchdog status register **/
#define DFSDM_FLT1AWSR			MMIO32(DFSDM_BASE + 0x1a8)
/** DFSDM_FLT1AWHTR analog watchdog high threshold register **/
#define DFSDM_FLT1AWHTR			MMIO32(DFSDM_BASE + 0x1ac)
/** DFSDM_FLT1AWCFR analog watchdog clear flag register **/
#define DFSDM_FLT1AWCFR			MMIO32(DFSDM_BASE + 0x1ac)
/** DFSDM_FLT1EXMAX Extremes detector maximum register **/
#define DFSDM_FLT1EXMAX			MMIO32(DFSDM_BASE + 0x1b0)
/** DFSDM_FLT1EXMIN Extremes detector minimum register **/
#define DFSDM_FLT1EXMIN			MMIO32(DFSDM_BASE + 0x1b4)
/** DFSDM_FLT1CNVTIMR conversion timer register **/
#define DFSDM_FLT1CNVTIMR			MMIO32(DFSDM_BASE + 0x1b8)
/** DFSDM_FLT2CR1 control register 1 **/
#define DFSDM_FLT2CR1			MMIO32(DFSDM_BASE + 0x200)
/** DFSDM_FLT2CR2 control register 2 **/
#define DFSDM_FLT2CR2			MMIO32(DFSDM_BASE + 0x204)
/** DFSDM_FLT2ISR interrupt and status register **/
#define DFSDM_FLT2ISR			MMIO32(DFSDM_BASE + 0x208)
/** DFSDM_FLT2ICR interrupt flag clear register **/
#define DFSDM_FLT2ICR			MMIO32(DFSDM_BASE + 0x20c)
/** DFSDM_FLT2JCHGR injected channel group selection register **/
#define DFSDM_FLT2JCHGR			MMIO32(DFSDM_BASE + 0x210)
/** DFSDM_FLT2FCR filter control register **/
#define DFSDM_FLT2FCR			MMIO32(DFSDM_BASE + 0x214)
/** DFSDM_FLT2JDATAR data register for injected group **/
#define DFSDM_FLT2JDATAR			MMIO32(DFSDM_BASE + 0x218)
/** DFSDM_FLT2RDATAR data register for the regular channel **/
#define DFSDM_FLT2RDATAR			MMIO32(DFSDM_BASE + 0x21c)
/** DFSDM_FLT2AWHTR analog watchdog high threshold register **/
#define DFSDM_FLT2AWHTR			MMIO32(DFSDM_BASE + 0x220)
/** DFSDM_FLT2AWLTR analog watchdog low threshold register **/
#define DFSDM_FLT2AWLTR			MMIO32(DFSDM_BASE + 0x224)
/** DFSDM_FLT2AWSR analog watchdog status register **/
#define DFSDM_FLT2AWSR			MMIO32(DFSDM_BASE + 0x228)
/** DFSDM_FLT2AWCFR analog watchdog clear flag register **/
#define DFSDM_FLT2AWCFR			MMIO32(DFSDM_BASE + 0x22c)
/** DFSDM_FLT2EXMAX Extremes detector maximum register **/
#define DFSDM_FLT2EXMAX			MMIO32(DFSDM_BASE + 0x230)
/** DFSDM_FLT2EXMIN Extremes detector minimum register **/
#define DFSDM_FLT2EXMIN			MMIO32(DFSDM_BASE + 0x234)
/** DFSDM_FLT2CNVTIMR conversion timer register **/
#define DFSDM_FLT2CNVTIMR			MMIO32(DFSDM_BASE + 0x238)
/** DFSDM_FLT3CR1 control register 1 **/
#define DFSDM_FLT3CR1			MMIO32(DFSDM_BASE + 0x280)
/** DFSDM_FLT3CR2 control register 2 **/
#define DFSDM_FLT3CR2			MMIO32(DFSDM_BASE + 0x284)
/** DFSDM_FLT3ISR interrupt and status register **/
#define DFSDM_FLT3ISR			MMIO32(DFSDM_BASE + 0x288)
/** DFSDM_FLT3ICR interrupt flag clear register **/
#define DFSDM_FLT3ICR			MMIO32(DFSDM_BASE + 0x28c)
/** DFSDM_FLT3JCHGR injected channel group selection register **/
#define DFSDM_FLT3JCHGR			MMIO32(DFSDM_BASE + 0x290)
/** DFSDM_FLT3FCR filter control register **/
#define DFSDM_FLT3FCR			MMIO32(DFSDM_BASE + 0x294)
/** DFSDM_FLT3JDATAR data register for injected group **/
#define DFSDM_FLT3JDATAR			MMIO32(DFSDM_BASE + 0x298)
/** DFSDM_FLT3RDATAR data register for the regular channel **/
#define DFSDM_FLT3RDATAR			MMIO32(DFSDM_BASE + 0x29c)
/** DFSDM_FLT3AWHTR analog watchdog high threshold register **/
#define DFSDM_FLT3AWHTR			MMIO32(DFSDM_BASE + 0x2a0)
/** DFSDM_FLT3AWLTR analog watchdog low threshold register **/
#define DFSDM_FLT3AWLTR			MMIO32(DFSDM_BASE + 0x2a4)
/** DFSDM_FLT3AWSR analog watchdog status register **/
#define DFSDM_FLT3AWSR			MMIO32(DFSDM_BASE + 0x2a8)
/** DFSDM_FLT3AWCFR analog watchdog clear flag register **/
#define DFSDM_FLT3AWCFR			MMIO32(DFSDM_BASE + 0x2ac)
/** DFSDM_FLT3EXMAX Extremes detector maximum register **/
#define DFSDM_FLT3EXMAX			MMIO32(DFSDM_BASE + 0x2b0)
/** DFSDM_FLT3EXMIN Extremes detector minimum register **/
#define DFSDM_FLT3EXMIN			MMIO32(DFSDM_BASE + 0x2b4)
/** DFSDM_FLT3CNVTIMR conversion timer register **/
#define DFSDM_FLT3CNVTIMR			MMIO32(DFSDM_BASE + 0x2b8)

/**@}*/


/** @defgroup dfsdm_ch0cfgr1 CH0CFGR1 channel configuration y register
@{*/

