grevaillot/svd_tools/headers/STM32H7x7_CM4/dfsdm.h
/** DFSDM_CH0CFGR1_DFSDMEN DFSDMEN **/
#define DFSDM_CH0CFGR1_DFSDMEN		(1 << 31)
/** DFSDM_CH0CFGR1_CKOUTSRC CKOUTSRC **/
#define DFSDM_CH0CFGR1_CKOUTSRC		(1 << 30)

#define DFSDM_CH0CFGR1_CKOUTDIV_SHIFT		16
#define DFSDM_CH0CFGR1_CKOUTDIV_MASK		0xff
/** @defgroup dfsdm_ch0cfgr1_ckoutdiv CKOUTDIV CKOUTDIV
@{*/
/**@}*/


#define DFSDM_CH0CFGR1_DATPACK_SHIFT		14
#define DFSDM_CH0CFGR1_DATPACK_MASK		0x03
/** @defgroup dfsdm_ch0cfgr1_datpack DATPACK DATPACK
@{*/
/**@}*/


#define DFSDM_CH0CFGR1_DATMPX_SHIFT		12
#define DFSDM_CH0CFGR1_DATMPX_MASK		0x03
/** @defgroup dfsdm_ch0cfgr1_datmpx DATMPX DATMPX
@{*/
/**@}*/

/** DFSDM_CH0CFGR1_CHINSEL CHINSEL **/
#define DFSDM_CH0CFGR1_CHINSEL		(1 << 8)
/** DFSDM_CH0CFGR1_CHEN CHEN **/
#define DFSDM_CH0CFGR1_CHEN		(1 << 7)
/** DFSDM_CH0CFGR1_CKABEN CKABEN **/
#define DFSDM_CH0CFGR1_CKABEN		(1 << 6)
/** DFSDM_CH0CFGR1_SCDEN SCDEN **/
#define DFSDM_CH0CFGR1_SCDEN		(1 << 5)

#define DFSDM_CH0CFGR1_SPICKSEL_SHIFT		2
#define DFSDM_CH0CFGR1_SPICKSEL_MASK		0x03
/** @defgroup dfsdm_ch0cfgr1_spicksel SPICKSEL SPICKSEL
@{*/
/**@}*/


#define DFSDM_CH0CFGR1_SITP_SHIFT		0
#define DFSDM_CH0CFGR1_SITP_MASK		0x03
/** @defgroup dfsdm_ch0cfgr1_sitp SITP SITP
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_ch0cfgr2 CH0CFGR2 channel configuration y register
@{*/


#define DFSDM_CH0CFGR2_OFFSET_SHIFT		8
#define DFSDM_CH0CFGR2_OFFSET_MASK		0xffffff
/** @defgroup dfsdm_ch0cfgr2_offset OFFSET OFFSET
@{*/
/**@}*/


#define DFSDM_CH0CFGR2_DTRBS_SHIFT		3
#define DFSDM_CH0CFGR2_DTRBS_MASK		0x1f
/** @defgroup dfsdm_ch0cfgr2_dtrbs DTRBS DTRBS
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_ch0awscdr CH0AWSCDR analog watchdog and short-circuit detector register
@{*/


#define DFSDM_CH0AWSCDR_AWFORD_SHIFT		22
#define DFSDM_CH0AWSCDR_AWFORD_MASK		0x03
/** @defgroup dfsdm_ch0awscdr_awford AWFORD AWFORD
@{*/
/**@}*/


#define DFSDM_CH0AWSCDR_AWFOSR_SHIFT		16
#define DFSDM_CH0AWSCDR_AWFOSR_MASK		0x1f
/** @defgroup dfsdm_ch0awscdr_awfosr AWFOSR AWFOSR
@{*/
/**@}*/


#define DFSDM_CH0AWSCDR_BKSCD_SHIFT		12
#define DFSDM_CH0AWSCDR_BKSCD_MASK		0x0f
/** @defgroup dfsdm_ch0awscdr_bkscd BKSCD BKSCD
@{*/
/**@}*/


#define DFSDM_CH0AWSCDR_SCDT_SHIFT		0
#define DFSDM_CH0AWSCDR_SCDT_MASK		0xff
/** @defgroup dfsdm_ch0awscdr_scdt SCDT SCDT
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_ch0wdatr CH0WDATR channel watchdog filter data register
@{*/


#define DFSDM_CH0WDATR_WDATA_SHIFT		0
#define DFSDM_CH0WDATR_WDATA_MASK		0xffff
/** @defgroup dfsdm_ch0wdatr_wdata WDATA WDATA
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_ch0datinr CH0DATINR channel data input register
@{*/


#define DFSDM_CH0DATINR_INDAT1_SHIFT		16
#define DFSDM_CH0DATINR_INDAT1_MASK		0xffff
/** @defgroup dfsdm_ch0datinr_indat1 INDAT1 INDAT1
@{*/
/**@}*/


#define DFSDM_CH0DATINR_INDAT0_SHIFT		0
#define DFSDM_CH0DATINR_INDAT0_MASK		0xffff
/** @defgroup dfsdm_ch0datinr_indat0 INDAT0 INDAT0
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_ch1cfgr1 CH1CFGR1 CHCFG1R1
@{*/

/** DFSDM_CH1CFGR1_DFSDMEN Global enable for DFSDM interface **/
#define DFSDM_CH1CFGR1_DFSDMEN		(1 << 31)
/** DFSDM_CH1CFGR1_CKOUTSRC Output serial clock source selection **/
#define DFSDM_CH1CFGR1_CKOUTSRC		(1 << 30)

#define DFSDM_CH1CFGR1_CKOUTDIV_SHIFT		16
#define DFSDM_CH1CFGR1_CKOUTDIV_MASK		0xff
/** @defgroup dfsdm_ch1cfgr1_ckoutdiv CKOUTDIV Output serial clock divider
@{*/
/**@}*/


#define DFSDM_CH1CFGR1_DATPACK_SHIFT		14
#define DFSDM_CH1CFGR1_DATPACK_MASK		0x03
/** @defgroup dfsdm_ch1cfgr1_datpack DATPACK DATPACK
@{*/
/**@}*/


#define DFSDM_CH1CFGR1_DATMPX_SHIFT		12
#define DFSDM_CH1CFGR1_DATMPX_MASK		0x03
/** @defgroup dfsdm_ch1cfgr1_datmpx DATMPX DATMPX
@{*/
/**@}*/

/** DFSDM_CH1CFGR1_CHINSEL CHINSEL **/
#define DFSDM_CH1CFGR1_CHINSEL		(1 << 8)
/** DFSDM_CH1CFGR1_CHEN CHEN **/
#define DFSDM_CH1CFGR1_CHEN		(1 << 7)
/** DFSDM_CH1CFGR1_CKABEN CKABEN **/
#define DFSDM_CH1CFGR1_CKABEN		(1 << 6)
/** DFSDM_CH1CFGR1_SCDEN SCDEN **/
#define DFSDM_CH1CFGR1_SCDEN		(1 << 5)

#define DFSDM_CH1CFGR1_SPICKSEL_SHIFT		2
#define DFSDM_CH1CFGR1_SPICKSEL_MASK		0x03
/** @defgroup dfsdm_ch1cfgr1_spicksel SPICKSEL SPICKSEL
@{*/
/**@}*/


#define DFSDM_CH1CFGR1_SITP_SHIFT		0
#define DFSDM_CH1CFGR1_SITP_MASK		0x03
/** @defgroup dfsdm_ch1cfgr1_sitp SITP SITP
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_ch1cfgr2 CH1CFGR2 CHCFG1R2
@{*/


#define DFSDM_CH1CFGR2_OFFSET_SHIFT		8
#define DFSDM_CH1CFGR2_OFFSET_MASK		0xffffff
/** @defgroup dfsdm_ch1cfgr2_offset OFFSET OFFSET
@{*/
/**@}*/


#define DFSDM_CH1CFGR2_DTRBS_SHIFT		3
#define DFSDM_CH1CFGR2_DTRBS_MASK		0x1f
/** @defgroup dfsdm_ch1cfgr2_dtrbs DTRBS DTRBS
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_ch1awscdr CH1AWSCDR AWSCD1R
@{*/


#define DFSDM_CH1AWSCDR_AWFORD_SHIFT		22
#define DFSDM_CH1AWSCDR_AWFORD_MASK		0x03
/** @defgroup dfsdm_ch1awscdr_awford AWFORD AWFORD
@{*/
/**@}*/


#define DFSDM_CH1AWSCDR_AWFOSR_SHIFT		16
#define DFSDM_CH1AWSCDR_AWFOSR_MASK		0x1f
/** @defgroup dfsdm_ch1awscdr_awfosr AWFOSR AWFOSR
@{*/
/**@}*/


#define DFSDM_CH1AWSCDR_BKSCD_SHIFT		12
#define DFSDM_CH1AWSCDR_BKSCD_MASK		0x0f
/** @defgroup dfsdm_ch1awscdr_bkscd BKSCD BKSCD
@{*/
/**@}*/


#define DFSDM_CH1AWSCDR_SCDT_SHIFT		0
#define DFSDM_CH1AWSCDR_SCDT_MASK		0xff
/** @defgroup dfsdm_ch1awscdr_scdt SCDT SCDT
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_ch1wdatr CH1WDATR CHWDAT1R
@{*/


#define DFSDM_CH1WDATR_WDATA_SHIFT		0
#define DFSDM_CH1WDATR_WDATA_MASK		0xffff
/** @defgroup dfsdm_ch1wdatr_wdata WDATA WDATA
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_ch1datinr CH1DATINR CHDATIN1R
@{*/


#define DFSDM_CH1DATINR_INDAT1_SHIFT		16
#define DFSDM_CH1DATINR_INDAT1_MASK		0xffff
/** @defgroup dfsdm_ch1datinr_indat1 INDAT1 INDAT1
@{*/
/**@}*/


#define DFSDM_CH1DATINR_INDAT0_SHIFT		0
#define DFSDM_CH1DATINR_INDAT0_MASK		0xffff
/** @defgroup dfsdm_ch1datinr_indat0 INDAT0 INDAT0
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_ch2cfgr1 CH2CFGR1 CHCFG2R1
@{*/

/** DFSDM_CH2CFGR1_DFSDMEN Global enable for DFSDM interface **/
#define DFSDM_CH2CFGR1_DFSDMEN		(1 << 31)
/** DFSDM_CH2CFGR1_CKOUTSRC Output serial clock source selection **/
#define DFSDM_CH2CFGR1_CKOUTSRC		(1 << 30)

#define DFSDM_CH2CFGR1_CKOUTDIV_SHIFT		16
#define DFSDM_CH2CFGR1_CKOUTDIV_MASK		0xff
/** @defgroup dfsdm_ch2cfgr1_ckoutdiv CKOUTDIV Output serial clock divider
@{*/
/**@}*/


#define DFSDM_CH2CFGR1_DATPACK_SHIFT		14
#define DFSDM_CH2CFGR1_DATPACK_MASK		0x03
/** @defgroup dfsdm_ch2cfgr1_datpack DATPACK DATPACK
@{*/
/**@}*/


