grevaillot/svd_tools/headers/STM32H7x7_CM4/dfsdm.h
#define DFSDM_CH2CFGR1_DATMPX_SHIFT		12
#define DFSDM_CH2CFGR1_DATMPX_MASK		0x03
/** @defgroup dfsdm_ch2cfgr1_datmpx DATMPX DATMPX
@{*/
/**@}*/

/** DFSDM_CH2CFGR1_CHINSEL CHINSEL **/
#define DFSDM_CH2CFGR1_CHINSEL		(1 << 8)
/** DFSDM_CH2CFGR1_CHEN CHEN **/
#define DFSDM_CH2CFGR1_CHEN		(1 << 7)
/** DFSDM_CH2CFGR1_CKABEN CKABEN **/
#define DFSDM_CH2CFGR1_CKABEN		(1 << 6)
/** DFSDM_CH2CFGR1_SCDEN SCDEN **/
#define DFSDM_CH2CFGR1_SCDEN		(1 << 5)

#define DFSDM_CH2CFGR1_SPICKSEL_SHIFT		2
#define DFSDM_CH2CFGR1_SPICKSEL_MASK		0x03
/** @defgroup dfsdm_ch2cfgr1_spicksel SPICKSEL SPICKSEL
@{*/
/**@}*/


#define DFSDM_CH2CFGR1_SITP_SHIFT		0
#define DFSDM_CH2CFGR1_SITP_MASK		0x03
/** @defgroup dfsdm_ch2cfgr1_sitp SITP SITP
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_ch2cfgr2 CH2CFGR2 CHCFG2R2
@{*/


#define DFSDM_CH2CFGR2_OFFSET_SHIFT		8
#define DFSDM_CH2CFGR2_OFFSET_MASK		0xffffff
/** @defgroup dfsdm_ch2cfgr2_offset OFFSET OFFSET
@{*/
/**@}*/


#define DFSDM_CH2CFGR2_DTRBS_SHIFT		3
#define DFSDM_CH2CFGR2_DTRBS_MASK		0x1f
/** @defgroup dfsdm_ch2cfgr2_dtrbs DTRBS DTRBS
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_ch2awscdr CH2AWSCDR AWSCD2R
@{*/


#define DFSDM_CH2AWSCDR_AWFORD_SHIFT		22
#define DFSDM_CH2AWSCDR_AWFORD_MASK		0x03
/** @defgroup dfsdm_ch2awscdr_awford AWFORD AWFORD
@{*/
/**@}*/


#define DFSDM_CH2AWSCDR_AWFOSR_SHIFT		16
#define DFSDM_CH2AWSCDR_AWFOSR_MASK		0x1f
/** @defgroup dfsdm_ch2awscdr_awfosr AWFOSR AWFOSR
@{*/
/**@}*/


#define DFSDM_CH2AWSCDR_BKSCD_SHIFT		12
#define DFSDM_CH2AWSCDR_BKSCD_MASK		0x0f
/** @defgroup dfsdm_ch2awscdr_bkscd BKSCD BKSCD
@{*/
/**@}*/


#define DFSDM_CH2AWSCDR_SCDT_SHIFT		0
#define DFSDM_CH2AWSCDR_SCDT_MASK		0xff
/** @defgroup dfsdm_ch2awscdr_scdt SCDT SCDT
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_ch2wdatr CH2WDATR CHWDAT2R
@{*/


#define DFSDM_CH2WDATR_WDATA_SHIFT		0
#define DFSDM_CH2WDATR_WDATA_MASK		0xffff
/** @defgroup dfsdm_ch2wdatr_wdata WDATA WDATA
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_ch2datinr CH2DATINR CHDATIN2R
@{*/


#define DFSDM_CH2DATINR_INDAT1_SHIFT		16
#define DFSDM_CH2DATINR_INDAT1_MASK		0xffff
/** @defgroup dfsdm_ch2datinr_indat1 INDAT1 INDAT1
@{*/
/**@}*/


#define DFSDM_CH2DATINR_INDAT0_SHIFT		0
#define DFSDM_CH2DATINR_INDAT0_MASK		0xffff
/** @defgroup dfsdm_ch2datinr_indat0 INDAT0 INDAT0
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_ch3cfgr1 CH3CFGR1 CHCFG3R1
@{*/

/** DFSDM_CH3CFGR1_DFSDMEN Global enable for DFSDM interface **/
#define DFSDM_CH3CFGR1_DFSDMEN		(1 << 31)
/** DFSDM_CH3CFGR1_CKOUTSRC Output serial clock source selection **/
#define DFSDM_CH3CFGR1_CKOUTSRC		(1 << 30)

#define DFSDM_CH3CFGR1_CKOUTDIV_SHIFT		16
#define DFSDM_CH3CFGR1_CKOUTDIV_MASK		0xff
/** @defgroup dfsdm_ch3cfgr1_ckoutdiv CKOUTDIV Output serial clock divider
@{*/
/**@}*/


#define DFSDM_CH3CFGR1_DATPACK_SHIFT		14
#define DFSDM_CH3CFGR1_DATPACK_MASK		0x03
/** @defgroup dfsdm_ch3cfgr1_datpack DATPACK DATPACK
@{*/
/**@}*/


#define DFSDM_CH3CFGR1_DATMPX_SHIFT		12
#define DFSDM_CH3CFGR1_DATMPX_MASK		0x03
/** @defgroup dfsdm_ch3cfgr1_datmpx DATMPX DATMPX
@{*/
/**@}*/

/** DFSDM_CH3CFGR1_CHINSEL CHINSEL **/
#define DFSDM_CH3CFGR1_CHINSEL		(1 << 8)
/** DFSDM_CH3CFGR1_CHEN CHEN **/
#define DFSDM_CH3CFGR1_CHEN		(1 << 7)
/** DFSDM_CH3CFGR1_CKABEN CKABEN **/
#define DFSDM_CH3CFGR1_CKABEN		(1 << 6)
/** DFSDM_CH3CFGR1_SCDEN SCDEN **/
#define DFSDM_CH3CFGR1_SCDEN		(1 << 5)

#define DFSDM_CH3CFGR1_SPICKSEL_SHIFT		2
#define DFSDM_CH3CFGR1_SPICKSEL_MASK		0x03
/** @defgroup dfsdm_ch3cfgr1_spicksel SPICKSEL SPICKSEL
@{*/
/**@}*/


#define DFSDM_CH3CFGR1_SITP_SHIFT		0
#define DFSDM_CH3CFGR1_SITP_MASK		0x03
/** @defgroup dfsdm_ch3cfgr1_sitp SITP SITP
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_ch3cfgr2 CH3CFGR2 CHCFG3R2
@{*/


#define DFSDM_CH3CFGR2_OFFSET_SHIFT		8
#define DFSDM_CH3CFGR2_OFFSET_MASK		0xffffff
/** @defgroup dfsdm_ch3cfgr2_offset OFFSET OFFSET
@{*/
/**@}*/


#define DFSDM_CH3CFGR2_DTRBS_SHIFT		3
#define DFSDM_CH3CFGR2_DTRBS_MASK		0x1f
/** @defgroup dfsdm_ch3cfgr2_dtrbs DTRBS DTRBS
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_ch3awscdr CH3AWSCDR AWSCD3R
@{*/


#define DFSDM_CH3AWSCDR_AWFORD_SHIFT		22
#define DFSDM_CH3AWSCDR_AWFORD_MASK		0x03
/** @defgroup dfsdm_ch3awscdr_awford AWFORD AWFORD
@{*/
/**@}*/


#define DFSDM_CH3AWSCDR_AWFOSR_SHIFT		16
#define DFSDM_CH3AWSCDR_AWFOSR_MASK		0x1f
/** @defgroup dfsdm_ch3awscdr_awfosr AWFOSR AWFOSR
@{*/
/**@}*/


#define DFSDM_CH3AWSCDR_BKSCD_SHIFT		12
#define DFSDM_CH3AWSCDR_BKSCD_MASK		0x0f
/** @defgroup dfsdm_ch3awscdr_bkscd BKSCD BKSCD
@{*/
/**@}*/


#define DFSDM_CH3AWSCDR_SCDT_SHIFT		0
#define DFSDM_CH3AWSCDR_SCDT_MASK		0xff
/** @defgroup dfsdm_ch3awscdr_scdt SCDT SCDT
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_ch3wdatr CH3WDATR CHWDAT3R
@{*/


#define DFSDM_CH3WDATR_WDATA_SHIFT		0
#define DFSDM_CH3WDATR_WDATA_MASK		0xffff
/** @defgroup dfsdm_ch3wdatr_wdata WDATA WDATA
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_ch3datinr CH3DATINR CHDATIN3R
@{*/


#define DFSDM_CH3DATINR_INDAT1_SHIFT		16
#define DFSDM_CH3DATINR_INDAT1_MASK		0xffff
/** @defgroup dfsdm_ch3datinr_indat1 INDAT1 INDAT1
@{*/
/**@}*/


#define DFSDM_CH3DATINR_INDAT0_SHIFT		0
#define DFSDM_CH3DATINR_INDAT0_MASK		0xffff
/** @defgroup dfsdm_ch3datinr_indat0 INDAT0 INDAT0
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_ch4cfgr1 CH4CFGR1 CHCFG4R1
@{*/

/** DFSDM_CH4CFGR1_DFSDMEN Global enable for DFSDM interface **/
#define DFSDM_CH4CFGR1_DFSDMEN		(1 << 31)
/** DFSDM_CH4CFGR1_CKOUTSRC Output serial clock source selection **/
#define DFSDM_CH4CFGR1_CKOUTSRC		(1 << 30)

#define DFSDM_CH4CFGR1_CKOUTDIV_SHIFT		16
#define DFSDM_CH4CFGR1_CKOUTDIV_MASK		0xff
/** @defgroup dfsdm_ch4cfgr1_ckoutdiv CKOUTDIV Output serial clock divider
@{*/
/**@}*/


#define DFSDM_CH4CFGR1_DATPACK_SHIFT		14
#define DFSDM_CH4CFGR1_DATPACK_MASK		0x03
/** @defgroup dfsdm_ch4cfgr1_datpack DATPACK DATPACK
@{*/
/**@}*/


#define DFSDM_CH4CFGR1_DATMPX_SHIFT		12
#define DFSDM_CH4CFGR1_DATMPX_MASK		0x03
/** @defgroup dfsdm_ch4cfgr1_datmpx DATMPX DATMPX
@{*/
/**@}*/

/** DFSDM_CH4CFGR1_CHINSEL CHINSEL **/
#define DFSDM_CH4CFGR1_CHINSEL		(1 << 8)
/** DFSDM_CH4CFGR1_CHEN CHEN **/
#define DFSDM_CH4CFGR1_CHEN		(1 << 7)
/** DFSDM_CH4CFGR1_CKABEN CKABEN **/
#define DFSDM_CH4CFGR1_CKABEN		(1 << 6)
/** DFSDM_CH4CFGR1_SCDEN SCDEN **/
#define DFSDM_CH4CFGR1_SCDEN		(1 << 5)

#define DFSDM_CH4CFGR1_SPICKSEL_SHIFT		2
#define DFSDM_CH4CFGR1_SPICKSEL_MASK		0x03
/** @defgroup dfsdm_ch4cfgr1_spicksel SPICKSEL SPICKSEL
@{*/
/**@}*/


#define DFSDM_CH4CFGR1_SITP_SHIFT		0
#define DFSDM_CH4CFGR1_SITP_MASK		0x03
/** @defgroup dfsdm_ch4cfgr1_sitp SITP SITP
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_ch4cfgr2 CH4CFGR2 CHCFG4R2
@{*/


#define DFSDM_CH4CFGR2_OFFSET_SHIFT		8
#define DFSDM_CH4CFGR2_OFFSET_MASK		0xffffff
/** @defgroup dfsdm_ch4cfgr2_offset OFFSET OFFSET
@{*/
/**@}*/


#define DFSDM_CH4CFGR2_DTRBS_SHIFT		3
#define DFSDM_CH4CFGR2_DTRBS_MASK		0x1f
/** @defgroup dfsdm_ch4cfgr2_dtrbs DTRBS DTRBS
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_ch4awscdr CH4AWSCDR AWSCD4R
@{*/


#define DFSDM_CH4AWSCDR_AWFORD_SHIFT		22
#define DFSDM_CH4AWSCDR_AWFORD_MASK		0x03
/** @defgroup dfsdm_ch4awscdr_awford AWFORD AWFORD
@{*/
/**@}*/


#define DFSDM_CH4AWSCDR_AWFOSR_SHIFT		16
#define DFSDM_CH4AWSCDR_AWFOSR_MASK		0x1f
/** @defgroup dfsdm_ch4awscdr_awfosr AWFOSR AWFOSR
@{*/
/**@}*/


#define DFSDM_CH4AWSCDR_BKSCD_SHIFT		12
#define DFSDM_CH4AWSCDR_BKSCD_MASK		0x0f
/** @defgroup dfsdm_ch4awscdr_bkscd BKSCD BKSCD
@{*/
/**@}*/


#define DFSDM_CH4AWSCDR_SCDT_SHIFT		0
#define DFSDM_CH4AWSCDR_SCDT_MASK		0xff
/** @defgroup dfsdm_ch4awscdr_scdt SCDT SCDT
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_ch4wdatr CH4WDATR CHWDAT4R
@{*/


#define DFSDM_CH4WDATR_WDATA_SHIFT		0
#define DFSDM_CH4WDATR_WDATA_MASK		0xffff
/** @defgroup dfsdm_ch4wdatr_wdata WDATA WDATA
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_ch4datinr CH4DATINR CHDATIN4R
@{*/


#define DFSDM_CH4DATINR_INDAT1_SHIFT		16
#define DFSDM_CH4DATINR_INDAT1_MASK		0xffff
/** @defgroup dfsdm_ch4datinr_indat1 INDAT1 INDAT1
@{*/
/**@}*/


#define DFSDM_CH4DATINR_INDAT0_SHIFT		0
#define DFSDM_CH4DATINR_INDAT0_MASK		0xffff
/** @defgroup dfsdm_ch4datinr_indat0 INDAT0 INDAT0
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_ch5cfgr1 CH5CFGR1 CHCFG5R1
@{*/

/** DFSDM_CH5CFGR1_DFSDMEN Global enable for DFSDM interface **/
#define DFSDM_CH5CFGR1_DFSDMEN		(1 << 31)
/** DFSDM_CH5CFGR1_CKOUTSRC Output serial clock source selection **/
#define DFSDM_CH5CFGR1_CKOUTSRC		(1 << 30)

#define DFSDM_CH5CFGR1_CKOUTDIV_SHIFT		16
#define DFSDM_CH5CFGR1_CKOUTDIV_MASK		0xff
/** @defgroup dfsdm_ch5cfgr1_ckoutdiv CKOUTDIV Output serial clock divider
@{*/
/**@}*/


