grevaillot/svd_tools/headers/STM32H7x7_CM4/dfsdm.h
#define DFSDM_CH5CFGR1_DATPACK_SHIFT		14
#define DFSDM_CH5CFGR1_DATPACK_MASK		0x03
/** @defgroup dfsdm_ch5cfgr1_datpack DATPACK DATPACK
@{*/
/**@}*/


#define DFSDM_CH5CFGR1_DATMPX_SHIFT		12
#define DFSDM_CH5CFGR1_DATMPX_MASK		0x03
/** @defgroup dfsdm_ch5cfgr1_datmpx DATMPX DATMPX
@{*/
/**@}*/

/** DFSDM_CH5CFGR1_CHINSEL CHINSEL **/
#define DFSDM_CH5CFGR1_CHINSEL		(1 << 8)
/** DFSDM_CH5CFGR1_CHEN CHEN **/
#define DFSDM_CH5CFGR1_CHEN		(1 << 7)
/** DFSDM_CH5CFGR1_CKABEN CKABEN **/
#define DFSDM_CH5CFGR1_CKABEN		(1 << 6)
/** DFSDM_CH5CFGR1_SCDEN SCDEN **/
#define DFSDM_CH5CFGR1_SCDEN		(1 << 5)

#define DFSDM_CH5CFGR1_SPICKSEL_SHIFT		2
#define DFSDM_CH5CFGR1_SPICKSEL_MASK		0x03
/** @defgroup dfsdm_ch5cfgr1_spicksel SPICKSEL SPICKSEL
@{*/
/**@}*/


#define DFSDM_CH5CFGR1_SITP_SHIFT		0
#define DFSDM_CH5CFGR1_SITP_MASK		0x03
/** @defgroup dfsdm_ch5cfgr1_sitp SITP SITP
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_ch5cfgr2 CH5CFGR2 CHCFG5R2
@{*/


#define DFSDM_CH5CFGR2_OFFSET_SHIFT		8
#define DFSDM_CH5CFGR2_OFFSET_MASK		0xffffff
/** @defgroup dfsdm_ch5cfgr2_offset OFFSET OFFSET
@{*/
/**@}*/


#define DFSDM_CH5CFGR2_DTRBS_SHIFT		3
#define DFSDM_CH5CFGR2_DTRBS_MASK		0x1f
/** @defgroup dfsdm_ch5cfgr2_dtrbs DTRBS DTRBS
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_ch5awscdr CH5AWSCDR AWSCD5R
@{*/


#define DFSDM_CH5AWSCDR_AWFORD_SHIFT		22
#define DFSDM_CH5AWSCDR_AWFORD_MASK		0x03
/** @defgroup dfsdm_ch5awscdr_awford AWFORD AWFORD
@{*/
/**@}*/


#define DFSDM_CH5AWSCDR_AWFOSR_SHIFT		16
#define DFSDM_CH5AWSCDR_AWFOSR_MASK		0x1f
/** @defgroup dfsdm_ch5awscdr_awfosr AWFOSR AWFOSR
@{*/
/**@}*/


#define DFSDM_CH5AWSCDR_BKSCD_SHIFT		12
#define DFSDM_CH5AWSCDR_BKSCD_MASK		0x0f
/** @defgroup dfsdm_ch5awscdr_bkscd BKSCD BKSCD
@{*/
/**@}*/


#define DFSDM_CH5AWSCDR_SCDT_SHIFT		0
#define DFSDM_CH5AWSCDR_SCDT_MASK		0xff
/** @defgroup dfsdm_ch5awscdr_scdt SCDT SCDT
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_ch5wdatr CH5WDATR CHWDAT5R
@{*/


#define DFSDM_CH5WDATR_WDATA_SHIFT		0
#define DFSDM_CH5WDATR_WDATA_MASK		0xffff
/** @defgroup dfsdm_ch5wdatr_wdata WDATA WDATA
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_ch5datinr CH5DATINR CHDATIN5R
@{*/


#define DFSDM_CH5DATINR_INDAT1_SHIFT		16
#define DFSDM_CH5DATINR_INDAT1_MASK		0xffff
/** @defgroup dfsdm_ch5datinr_indat1 INDAT1 INDAT1
@{*/
/**@}*/


#define DFSDM_CH5DATINR_INDAT0_SHIFT		0
#define DFSDM_CH5DATINR_INDAT0_MASK		0xffff
/** @defgroup dfsdm_ch5datinr_indat0 INDAT0 INDAT0
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_ch6cfgr1 CH6CFGR1 CHCFG6R1
@{*/

/** DFSDM_CH6CFGR1_DFSDMEN Global enable for DFSDM interface **/
#define DFSDM_CH6CFGR1_DFSDMEN		(1 << 31)
/** DFSDM_CH6CFGR1_CKOUTSRC Output serial clock source selection **/
#define DFSDM_CH6CFGR1_CKOUTSRC		(1 << 30)

#define DFSDM_CH6CFGR1_CKOUTDIV_SHIFT		16
#define DFSDM_CH6CFGR1_CKOUTDIV_MASK		0xff
/** @defgroup dfsdm_ch6cfgr1_ckoutdiv CKOUTDIV Output serial clock divider
@{*/
/**@}*/


#define DFSDM_CH6CFGR1_DATPACK_SHIFT		14
#define DFSDM_CH6CFGR1_DATPACK_MASK		0x03
/** @defgroup dfsdm_ch6cfgr1_datpack DATPACK DATPACK
@{*/
/**@}*/


#define DFSDM_CH6CFGR1_DATMPX_SHIFT		12
#define DFSDM_CH6CFGR1_DATMPX_MASK		0x03
/** @defgroup dfsdm_ch6cfgr1_datmpx DATMPX DATMPX
@{*/
/**@}*/

/** DFSDM_CH6CFGR1_CHINSEL CHINSEL **/
#define DFSDM_CH6CFGR1_CHINSEL		(1 << 8)
/** DFSDM_CH6CFGR1_CHEN CHEN **/
#define DFSDM_CH6CFGR1_CHEN		(1 << 7)
/** DFSDM_CH6CFGR1_CKABEN CKABEN **/
#define DFSDM_CH6CFGR1_CKABEN		(1 << 6)
/** DFSDM_CH6CFGR1_SCDEN SCDEN **/
#define DFSDM_CH6CFGR1_SCDEN		(1 << 5)

#define DFSDM_CH6CFGR1_SPICKSEL_SHIFT		2
#define DFSDM_CH6CFGR1_SPICKSEL_MASK		0x03
/** @defgroup dfsdm_ch6cfgr1_spicksel SPICKSEL SPICKSEL
@{*/
/**@}*/


#define DFSDM_CH6CFGR1_SITP_SHIFT		0
#define DFSDM_CH6CFGR1_SITP_MASK		0x03
/** @defgroup dfsdm_ch6cfgr1_sitp SITP SITP
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_ch6cfgr2 CH6CFGR2 CH6CFGR2
@{*/


#define DFSDM_CH6CFGR2_OFFSET_SHIFT		8
#define DFSDM_CH6CFGR2_OFFSET_MASK		0xffffff
/** @defgroup dfsdm_ch6cfgr2_offset OFFSET OFFSET
@{*/
/**@}*/


#define DFSDM_CH6CFGR2_DTRBS_SHIFT		3
#define DFSDM_CH6CFGR2_DTRBS_MASK		0x1f
/** @defgroup dfsdm_ch6cfgr2_dtrbs DTRBS DTRBS
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_ch6awscdr CH6AWSCDR AWSCD6R
@{*/


#define DFSDM_CH6AWSCDR_AWFORD_SHIFT		22
#define DFSDM_CH6AWSCDR_AWFORD_MASK		0x03
/** @defgroup dfsdm_ch6awscdr_awford AWFORD AWFORD
@{*/
/**@}*/


#define DFSDM_CH6AWSCDR_AWFOSR_SHIFT		16
#define DFSDM_CH6AWSCDR_AWFOSR_MASK		0x1f
/** @defgroup dfsdm_ch6awscdr_awfosr AWFOSR AWFOSR
@{*/
/**@}*/


#define DFSDM_CH6AWSCDR_BKSCD_SHIFT		12
#define DFSDM_CH6AWSCDR_BKSCD_MASK		0x0f
/** @defgroup dfsdm_ch6awscdr_bkscd BKSCD BKSCD
@{*/
/**@}*/


#define DFSDM_CH6AWSCDR_SCDT_SHIFT		0
#define DFSDM_CH6AWSCDR_SCDT_MASK		0xff
/** @defgroup dfsdm_ch6awscdr_scdt SCDT SCDT
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_ch6wdatr CH6WDATR CHWDAT6R
@{*/


#define DFSDM_CH6WDATR_WDATA_SHIFT		0
#define DFSDM_CH6WDATR_WDATA_MASK		0xffff
/** @defgroup dfsdm_ch6wdatr_wdata WDATA WDATA
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_ch6datinr CH6DATINR CHDATIN6R
@{*/


#define DFSDM_CH6DATINR_INDAT1_SHIFT		16
#define DFSDM_CH6DATINR_INDAT1_MASK		0xffff
/** @defgroup dfsdm_ch6datinr_indat1 INDAT1 INDAT1
@{*/
/**@}*/


#define DFSDM_CH6DATINR_INDAT0_SHIFT		0
#define DFSDM_CH6DATINR_INDAT0_MASK		0xffff
/** @defgroup dfsdm_ch6datinr_indat0 INDAT0 INDAT0
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_ch7cfgr1 CH7CFGR1 CHCFG7R1
@{*/

/** DFSDM_CH7CFGR1_DFSDMEN Global enable for DFSDM interface **/
#define DFSDM_CH7CFGR1_DFSDMEN		(1 << 31)
/** DFSDM_CH7CFGR1_CKOUTSRC Output serial clock source selection **/
#define DFSDM_CH7CFGR1_CKOUTSRC		(1 << 30)

#define DFSDM_CH7CFGR1_CKOUTDIV_SHIFT		16
#define DFSDM_CH7CFGR1_CKOUTDIV_MASK		0xff
/** @defgroup dfsdm_ch7cfgr1_ckoutdiv CKOUTDIV Output serial clock divider
@{*/
/**@}*/


#define DFSDM_CH7CFGR1_DATPACK_SHIFT		14
#define DFSDM_CH7CFGR1_DATPACK_MASK		0x03
/** @defgroup dfsdm_ch7cfgr1_datpack DATPACK DATPACK
@{*/
/**@}*/


#define DFSDM_CH7CFGR1_DATMPX_SHIFT		12
#define DFSDM_CH7CFGR1_DATMPX_MASK		0x03
/** @defgroup dfsdm_ch7cfgr1_datmpx DATMPX DATMPX
@{*/
/**@}*/

/** DFSDM_CH7CFGR1_CHINSEL CHINSEL **/
#define DFSDM_CH7CFGR1_CHINSEL		(1 << 8)
/** DFSDM_CH7CFGR1_CHEN CHEN **/
#define DFSDM_CH7CFGR1_CHEN		(1 << 7)
/** DFSDM_CH7CFGR1_CKABEN CKABEN **/
#define DFSDM_CH7CFGR1_CKABEN		(1 << 6)
/** DFSDM_CH7CFGR1_SCDEN SCDEN **/
#define DFSDM_CH7CFGR1_SCDEN		(1 << 5)

#define DFSDM_CH7CFGR1_SPICKSEL_SHIFT		2
#define DFSDM_CH7CFGR1_SPICKSEL_MASK		0x03
/** @defgroup dfsdm_ch7cfgr1_spicksel SPICKSEL SPICKSEL
@{*/
/**@}*/


