grevaillot/svd_tools/headers/STM32H7x7_CM4/dfsdm.h
/** @defgroup dfsdm_flt0rdatar FLT0RDATAR data register for the regular channel
@{*/


#define DFSDM_FLT0RDATAR_RDATA_SHIFT		8
#define DFSDM_FLT0RDATAR_RDATA_MASK		0xffffff
/** @defgroup dfsdm_flt0rdatar_rdata RDATA Regular channel conversion data
@{*/
/**@}*/

/** DFSDM_FLT0RDATAR_RPEND Regular channel pending data **/
#define DFSDM_FLT0RDATAR_RPEND		(1 << 4)

#define DFSDM_FLT0RDATAR_RDATACH_SHIFT		0
#define DFSDM_FLT0RDATAR_RDATACH_MASK		0x07
/** @defgroup dfsdm_flt0rdatar_rdatach RDATACH Regular channel most recently converted
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_flt0awhtr FLT0AWHTR analog watchdog high threshold register
@{*/


#define DFSDM_FLT0AWHTR_AWHT_SHIFT		8
#define DFSDM_FLT0AWHTR_AWHT_MASK		0xffffff
/** @defgroup dfsdm_flt0awhtr_awht AWHT Analog watchdog high threshold
@{*/
/**@}*/


#define DFSDM_FLT0AWHTR_BKAWH_SHIFT		0
#define DFSDM_FLT0AWHTR_BKAWH_MASK		0x0f
/** @defgroup dfsdm_flt0awhtr_bkawh BKAWH Break signal assignment to analog watchdog high threshold event
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_flt0awltr FLT0AWLTR analog watchdog low threshold register
@{*/


#define DFSDM_FLT0AWLTR_AWLT_SHIFT		8
#define DFSDM_FLT0AWLTR_AWLT_MASK		0xffffff
/** @defgroup dfsdm_flt0awltr_awlt AWLT Analog watchdog low threshold
@{*/
/**@}*/


#define DFSDM_FLT0AWLTR_BKAWL_SHIFT		0
#define DFSDM_FLT0AWLTR_BKAWL_MASK		0x0f
/** @defgroup dfsdm_flt0awltr_bkawl BKAWL Break signal assignment to analog watchdog low threshold event
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_flt0awsr FLT0AWSR analog watchdog status register
@{*/


#define DFSDM_FLT0AWSR_AWHTF_SHIFT		8
#define DFSDM_FLT0AWSR_AWHTF_MASK		0xff
/** @defgroup dfsdm_flt0awsr_awhtf AWHTF Analog watchdog high threshold flag
@{*/
/**@}*/


#define DFSDM_FLT0AWSR_AWLTF_SHIFT		0
#define DFSDM_FLT0AWSR_AWLTF_MASK		0xff
/** @defgroup dfsdm_flt0awsr_awltf AWLTF Analog watchdog low threshold flag
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_flt0awcfr FLT0AWCFR analog watchdog clear flag register
@{*/


#define DFSDM_FLT0AWCFR_CLRAWHTF_SHIFT		8
#define DFSDM_FLT0AWCFR_CLRAWHTF_MASK		0xff
/** @defgroup dfsdm_flt0awcfr_clrawhtf CLRAWHTF Clear the analog watchdog high threshold flag
@{*/
/**@}*/


#define DFSDM_FLT0AWCFR_CLRAWLTF_SHIFT		0
#define DFSDM_FLT0AWCFR_CLRAWLTF_MASK		0xff
/** @defgroup dfsdm_flt0awcfr_clrawltf CLRAWLTF Clear the analog watchdog low threshold flag
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_flt0exmax FLT0EXMAX Extremes detector maximum register
@{*/


#define DFSDM_FLT0EXMAX_EXMAX_SHIFT		8
#define DFSDM_FLT0EXMAX_EXMAX_MASK		0xffffff
/** @defgroup dfsdm_flt0exmax_exmax EXMAX Extremes detector maximum value
@{*/
/**@}*/


#define DFSDM_FLT0EXMAX_EXMAXCH_SHIFT		0
#define DFSDM_FLT0EXMAX_EXMAXCH_MASK		0x07
/** @defgroup dfsdm_flt0exmax_exmaxch EXMAXCH Extremes detector maximum data channel
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_flt0exmin FLT0EXMIN Extremes detector minimum register
@{*/


#define DFSDM_FLT0EXMIN_EXMIN_SHIFT		8
#define DFSDM_FLT0EXMIN_EXMIN_MASK		0xffffff
/** @defgroup dfsdm_flt0exmin_exmin EXMIN EXMIN
@{*/
/**@}*/


#define DFSDM_FLT0EXMIN_EXMINCH_SHIFT		0
#define DFSDM_FLT0EXMIN_EXMINCH_MASK		0x07
/** @defgroup dfsdm_flt0exmin_exminch EXMINCH Extremes detector minimum data channel
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_flt0cnvtimr FLT0CNVTIMR conversion timer register
@{*/


#define DFSDM_FLT0CNVTIMR_CNVCNT_SHIFT		4
#define DFSDM_FLT0CNVTIMR_CNVCNT_MASK		0xfffffff
/** @defgroup dfsdm_flt0cnvtimr_cnvcnt CNVCNT 28-bit timer counting conversion time t = CNVCNT[27:0] / fDFSDM_CKIN
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_flt1cr1 FLT1CR1 control register 1
@{*/

/** DFSDM_FLT1CR1_AWFSEL Analog watchdog fast mode select **/
#define DFSDM_FLT1CR1_AWFSEL		(1 << 30)
/** DFSDM_FLT1CR1_FAST Fast conversion mode selection for regular conversions **/
#define DFSDM_FLT1CR1_FAST		(1 << 29)

#define DFSDM_FLT1CR1_RCH_SHIFT		24
#define DFSDM_FLT1CR1_RCH_MASK		0x07
/** @defgroup dfsdm_flt1cr1_rch RCH Regular channel selection
@{*/
/**@}*/

/** DFSDM_FLT1CR1_RDMAEN DMA channel enabled to read data for the regular conversion **/
#define DFSDM_FLT1CR1_RDMAEN		(1 << 21)
/** DFSDM_FLT1CR1_RSYNC Launch regular conversion synchronously with DFSDM0 **/
#define DFSDM_FLT1CR1_RSYNC		(1 << 19)
/** DFSDM_FLT1CR1_RCONT Continuous mode selection for regular conversions **/
#define DFSDM_FLT1CR1_RCONT		(1 << 18)
/** DFSDM_FLT1CR1_RSWSTART Software start of a conversion on the regular channel **/
#define DFSDM_FLT1CR1_RSWSTART		(1 << 17)

#define DFSDM_FLT1CR1_JEXTEN_SHIFT		13
#define DFSDM_FLT1CR1_JEXTEN_MASK		0x03
/** @defgroup dfsdm_flt1cr1_jexten JEXTEN Trigger enable and trigger edge selection for injected conversions
@{*/
/**@}*/


#define DFSDM_FLT1CR1_JEXTSEL_SHIFT		8
#define DFSDM_FLT1CR1_JEXTSEL_MASK		0x07
/** @defgroup dfsdm_flt1cr1_jextsel JEXTSEL Trigger signal selection for launching injected conversions
@{*/
/**@}*/

/** DFSDM_FLT1CR1_JDMAEN DMA channel enabled to read data for the injected channel group **/
#define DFSDM_FLT1CR1_JDMAEN		(1 << 5)
/** DFSDM_FLT1CR1_JSCAN Scanning conversion mode for injected conversions **/
#define DFSDM_FLT1CR1_JSCAN		(1 << 4)
/** DFSDM_FLT1CR1_JSYNC Launch an injected conversion synchronously with the DFSDM0 JSWSTART trigger **/
#define DFSDM_FLT1CR1_JSYNC		(1 << 3)
/** DFSDM_FLT1CR1_JSWSTART Start a conversion of the injected group of channels **/
#define DFSDM_FLT1CR1_JSWSTART		(1 << 1)
/** DFSDM_FLT1CR1_DFEN DFSDM enable **/
#define DFSDM_FLT1CR1_DFEN		(1 << 0)

/**@}*/

/** @defgroup dfsdm_flt1cr2 FLT1CR2 control register 2
@{*/


#define DFSDM_FLT1CR2_AWDCH_SHIFT		16
#define DFSDM_FLT1CR2_AWDCH_MASK		0xff
/** @defgroup dfsdm_flt1cr2_awdch AWDCH Analog watchdog channel selection
@{*/
/**@}*/


#define DFSDM_FLT1CR2_EXCH_SHIFT		8
#define DFSDM_FLT1CR2_EXCH_MASK		0xff
/** @defgroup dfsdm_flt1cr2_exch EXCH Extremes detector channel selection
@{*/
/**@}*/

/** DFSDM_FLT1CR2_CKABIE Clock absence interrupt enable **/
#define DFSDM_FLT1CR2_CKABIE		(1 << 6)
/** DFSDM_FLT1CR2_SCDIE Short-circuit detector interrupt enable **/
#define DFSDM_FLT1CR2_SCDIE		(1 << 5)
/** DFSDM_FLT1CR2_AWDIE Analog watchdog interrupt enable **/
#define DFSDM_FLT1CR2_AWDIE		(1 << 4)
/** DFSDM_FLT1CR2_ROVRIE Regular data overrun interrupt enable **/
#define DFSDM_FLT1CR2_ROVRIE		(1 << 3)
/** DFSDM_FLT1CR2_JOVRIE Injected data overrun interrupt enable **/
#define DFSDM_FLT1CR2_JOVRIE		(1 << 2)
/** DFSDM_FLT1CR2_REOCIE Regular end of conversion interrupt enable **/
#define DFSDM_FLT1CR2_REOCIE		(1 << 1)
/** DFSDM_FLT1CR2_JEOCIE Injected end of conversion interrupt enable **/
#define DFSDM_FLT1CR2_JEOCIE		(1 << 0)

/**@}*/

/** @defgroup dfsdm_flt1isr FLT1ISR interrupt and status register
@{*/


#define DFSDM_FLT1ISR_SCDF_SHIFT		24
#define DFSDM_FLT1ISR_SCDF_MASK		0xff
/** @defgroup dfsdm_flt1isr_scdf SCDF short-circuit detector flag
@{*/
/**@}*/


#define DFSDM_FLT1ISR_CKABF_SHIFT		16
#define DFSDM_FLT1ISR_CKABF_MASK		0xff
/** @defgroup dfsdm_flt1isr_ckabf CKABF Clock absence flag
@{*/
/**@}*/

/** DFSDM_FLT1ISR_RCIP Regular conversion in progress status **/
#define DFSDM_FLT1ISR_RCIP		(1 << 14)
/** DFSDM_FLT1ISR_JCIP Injected conversion in progress status **/
#define DFSDM_FLT1ISR_JCIP		(1 << 13)
/** DFSDM_FLT1ISR_AWDF Analog watchdog **/
#define DFSDM_FLT1ISR_AWDF		(1 << 4)
/** DFSDM_FLT1ISR_ROVRF Regular conversion overrun flag **/
#define DFSDM_FLT1ISR_ROVRF		(1 << 3)
/** DFSDM_FLT1ISR_JOVRF Injected conversion overrun flag **/
#define DFSDM_FLT1ISR_JOVRF		(1 << 2)
/** DFSDM_FLT1ISR_REOCF End of regular conversion flag **/
#define DFSDM_FLT1ISR_REOCF		(1 << 1)
/** DFSDM_FLT1ISR_JEOCF End of injected conversion flag **/
#define DFSDM_FLT1ISR_JEOCF		(1 << 0)

/**@}*/

