grevaillot/svd_tools/headers/STM32H7x7_CM4/dfsdm.h
/** @defgroup dfsdm_flt1icr FLT1ICR interrupt flag clear register
@{*/


#define DFSDM_FLT1ICR_CLRSCDF_SHIFT		24
#define DFSDM_FLT1ICR_CLRSCDF_MASK		0xff
/** @defgroup dfsdm_flt1icr_clrscdf CLRSCDF Clear the short-circuit detector flag
@{*/
/**@}*/


#define DFSDM_FLT1ICR_CLRCKABF_SHIFT		16
#define DFSDM_FLT1ICR_CLRCKABF_MASK		0xff
/** @defgroup dfsdm_flt1icr_clrckabf CLRCKABF Clear the clock absence flag
@{*/
/**@}*/

/** DFSDM_FLT1ICR_CLRROVRF Clear the regular conversion overrun flag **/
#define DFSDM_FLT1ICR_CLRROVRF		(1 << 3)
/** DFSDM_FLT1ICR_CLRJOVRF Clear the injected conversion overrun flag **/
#define DFSDM_FLT1ICR_CLRJOVRF		(1 << 2)

/**@}*/

/** @defgroup dfsdm_flt1jchgr FLT1JCHGR injected channel group selection register
@{*/


#define DFSDM_FLT1JCHGR_JCHG_SHIFT		0
#define DFSDM_FLT1JCHGR_JCHG_MASK		0xff
/** @defgroup dfsdm_flt1jchgr_jchg JCHG Injected channel group selection
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_flt1fcr FLT1FCR filter control register
@{*/


#define DFSDM_FLT1FCR_FORD_SHIFT		29
#define DFSDM_FLT1FCR_FORD_MASK		0x07
/** @defgroup dfsdm_flt1fcr_ford FORD Sinc filter order
@{*/
/**@}*/


#define DFSDM_FLT1FCR_FOSR_SHIFT		16
#define DFSDM_FLT1FCR_FOSR_MASK		0x3ff
/** @defgroup dfsdm_flt1fcr_fosr FOSR Sinc filter oversampling ratio (decimation rate)
@{*/
/**@}*/


#define DFSDM_FLT1FCR_IOSR_SHIFT		0
#define DFSDM_FLT1FCR_IOSR_MASK		0xff
/** @defgroup dfsdm_flt1fcr_iosr IOSR Integrator oversampling ratio (averaging length)
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_flt1jdatar FLT1JDATAR data register for injected group
@{*/


#define DFSDM_FLT1JDATAR_JDATA_SHIFT		8
#define DFSDM_FLT1JDATAR_JDATA_MASK		0xffffff
/** @defgroup dfsdm_flt1jdatar_jdata JDATA Injected group conversion data
@{*/
/**@}*/


#define DFSDM_FLT1JDATAR_JDATACH_SHIFT		0
#define DFSDM_FLT1JDATAR_JDATACH_MASK		0x07
/** @defgroup dfsdm_flt1jdatar_jdatach JDATACH Injected channel most recently converted
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_flt1rdatar FLT1RDATAR data register for the regular channel
@{*/


#define DFSDM_FLT1RDATAR_RDATA_SHIFT		8
#define DFSDM_FLT1RDATAR_RDATA_MASK		0xffffff
/** @defgroup dfsdm_flt1rdatar_rdata RDATA Regular channel conversion data
@{*/
/**@}*/

/** DFSDM_FLT1RDATAR_RPEND Regular channel pending data **/
#define DFSDM_FLT1RDATAR_RPEND		(1 << 4)

#define DFSDM_FLT1RDATAR_RDATACH_SHIFT		0
#define DFSDM_FLT1RDATAR_RDATACH_MASK		0x07
/** @defgroup dfsdm_flt1rdatar_rdatach RDATACH Regular channel most recently converted
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_flt1awltr FLT1AWLTR analog watchdog low threshold register
@{*/


#define DFSDM_FLT1AWLTR_AWLT_SHIFT		8
#define DFSDM_FLT1AWLTR_AWLT_MASK		0xffffff
/** @defgroup dfsdm_flt1awltr_awlt AWLT Analog watchdog low threshold
@{*/
/**@}*/


#define DFSDM_FLT1AWLTR_BKAWL_SHIFT		0
#define DFSDM_FLT1AWLTR_BKAWL_MASK		0x0f
/** @defgroup dfsdm_flt1awltr_bkawl BKAWL Break signal assignment to analog watchdog low threshold event
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_flt1awsr FLT1AWSR analog watchdog status register
@{*/


#define DFSDM_FLT1AWSR_AWHTF_SHIFT		8
#define DFSDM_FLT1AWSR_AWHTF_MASK		0xff
/** @defgroup dfsdm_flt1awsr_awhtf AWHTF Analog watchdog high threshold flag
@{*/
/**@}*/


#define DFSDM_FLT1AWSR_AWLTF_SHIFT		0
#define DFSDM_FLT1AWSR_AWLTF_MASK		0xff
/** @defgroup dfsdm_flt1awsr_awltf AWLTF Analog watchdog low threshold flag
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_flt1awhtr FLT1AWHTR analog watchdog high threshold register
@{*/


#define DFSDM_FLT1AWHTR_AWHT_SHIFT		8
#define DFSDM_FLT1AWHTR_AWHT_MASK		0xffffff
/** @defgroup dfsdm_flt1awhtr_awht AWHT Analog watchdog high threshold
@{*/
/**@}*/


#define DFSDM_FLT1AWHTR_BKAWH_SHIFT		0
#define DFSDM_FLT1AWHTR_BKAWH_MASK		0x0f
/** @defgroup dfsdm_flt1awhtr_bkawh BKAWH Break signal assignment to analog watchdog high threshold event
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_flt1awcfr FLT1AWCFR analog watchdog clear flag register
@{*/


#define DFSDM_FLT1AWCFR_CLRAWHTF_SHIFT		8
#define DFSDM_FLT1AWCFR_CLRAWHTF_MASK		0xff
/** @defgroup dfsdm_flt1awcfr_clrawhtf CLRAWHTF Clear the analog watchdog high threshold flag
@{*/
/**@}*/


#define DFSDM_FLT1AWCFR_CLRAWLTF_SHIFT		0
#define DFSDM_FLT1AWCFR_CLRAWLTF_MASK		0xff
/** @defgroup dfsdm_flt1awcfr_clrawltf CLRAWLTF Clear the analog watchdog low threshold flag
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_flt1exmax FLT1EXMAX Extremes detector maximum register
@{*/


#define DFSDM_FLT1EXMAX_EXMAX_SHIFT		8
#define DFSDM_FLT1EXMAX_EXMAX_MASK		0xffffff
/** @defgroup dfsdm_flt1exmax_exmax EXMAX Extremes detector maximum value
@{*/
/**@}*/


#define DFSDM_FLT1EXMAX_EXMAXCH_SHIFT		0
#define DFSDM_FLT1EXMAX_EXMAXCH_MASK		0x07
/** @defgroup dfsdm_flt1exmax_exmaxch EXMAXCH Extremes detector maximum data channel
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_flt1exmin FLT1EXMIN Extremes detector minimum register
@{*/


#define DFSDM_FLT1EXMIN_EXMIN_SHIFT		8
#define DFSDM_FLT1EXMIN_EXMIN_MASK		0xffffff
/** @defgroup dfsdm_flt1exmin_exmin EXMIN EXMIN
@{*/
/**@}*/


#define DFSDM_FLT1EXMIN_EXMINCH_SHIFT		0
#define DFSDM_FLT1EXMIN_EXMINCH_MASK		0x07
/** @defgroup dfsdm_flt1exmin_exminch EXMINCH Extremes detector minimum data channel
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_flt1cnvtimr FLT1CNVTIMR conversion timer register
@{*/


#define DFSDM_FLT1CNVTIMR_CNVCNT_SHIFT		4
#define DFSDM_FLT1CNVTIMR_CNVCNT_MASK		0xfffffff
/** @defgroup dfsdm_flt1cnvtimr_cnvcnt CNVCNT 28-bit timer counting conversion time t = CNVCNT[27:0] / fDFSDM_CKIN
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_flt2cr1 FLT2CR1 control register 1
@{*/

/** DFSDM_FLT2CR1_AWFSEL Analog watchdog fast mode select **/
#define DFSDM_FLT2CR1_AWFSEL		(1 << 30)
/** DFSDM_FLT2CR1_FAST Fast conversion mode selection for regular conversions **/
#define DFSDM_FLT2CR1_FAST		(1 << 29)

#define DFSDM_FLT2CR1_RCH_SHIFT		24
#define DFSDM_FLT2CR1_RCH_MASK		0x07
/** @defgroup dfsdm_flt2cr1_rch RCH Regular channel selection
@{*/
/**@}*/

/** DFSDM_FLT2CR1_RDMAEN DMA channel enabled to read data for the regular conversion **/
#define DFSDM_FLT2CR1_RDMAEN		(1 << 21)
/** DFSDM_FLT2CR1_RSYNC Launch regular conversion synchronously with DFSDM0 **/
#define DFSDM_FLT2CR1_RSYNC		(1 << 19)
/** DFSDM_FLT2CR1_RCONT Continuous mode selection for regular conversions **/
#define DFSDM_FLT2CR1_RCONT		(1 << 18)
/** DFSDM_FLT2CR1_RSWSTART Software start of a conversion on the regular channel **/
#define DFSDM_FLT2CR1_RSWSTART		(1 << 17)

#define DFSDM_FLT2CR1_JEXTEN_SHIFT		13
#define DFSDM_FLT2CR1_JEXTEN_MASK		0x03
/** @defgroup dfsdm_flt2cr1_jexten JEXTEN Trigger enable and trigger edge selection for injected conversions
@{*/
/**@}*/


