grevaillot/svd_tools/headers/STM32H7x7_CM4/dfsdm.h
#define DFSDM_FLT2CR1_JEXTSEL_SHIFT		8
#define DFSDM_FLT2CR1_JEXTSEL_MASK		0x07
/** @defgroup dfsdm_flt2cr1_jextsel JEXTSEL Trigger signal selection for launching injected conversions
@{*/
/**@}*/

/** DFSDM_FLT2CR1_JDMAEN DMA channel enabled to read data for the injected channel group **/
#define DFSDM_FLT2CR1_JDMAEN		(1 << 5)
/** DFSDM_FLT2CR1_JSCAN Scanning conversion mode for injected conversions **/
#define DFSDM_FLT2CR1_JSCAN		(1 << 4)
/** DFSDM_FLT2CR1_JSYNC Launch an injected conversion synchronously with the DFSDM0 JSWSTART trigger **/
#define DFSDM_FLT2CR1_JSYNC		(1 << 3)
/** DFSDM_FLT2CR1_JSWSTART Start a conversion of the injected group of channels **/
#define DFSDM_FLT2CR1_JSWSTART		(1 << 1)
/** DFSDM_FLT2CR1_DFEN DFSDM enable **/
#define DFSDM_FLT2CR1_DFEN		(1 << 0)

/**@}*/

/** @defgroup dfsdm_flt2cr2 FLT2CR2 control register 2
@{*/


#define DFSDM_FLT2CR2_AWDCH_SHIFT		16
#define DFSDM_FLT2CR2_AWDCH_MASK		0xff
/** @defgroup dfsdm_flt2cr2_awdch AWDCH Analog watchdog channel selection
@{*/
/**@}*/


#define DFSDM_FLT2CR2_EXCH_SHIFT		8
#define DFSDM_FLT2CR2_EXCH_MASK		0xff
/** @defgroup dfsdm_flt2cr2_exch EXCH Extremes detector channel selection
@{*/
/**@}*/

/** DFSDM_FLT2CR2_CKABIE Clock absence interrupt enable **/
#define DFSDM_FLT2CR2_CKABIE		(1 << 6)
/** DFSDM_FLT2CR2_SCDIE Short-circuit detector interrupt enable **/
#define DFSDM_FLT2CR2_SCDIE		(1 << 5)
/** DFSDM_FLT2CR2_AWDIE Analog watchdog interrupt enable **/
#define DFSDM_FLT2CR2_AWDIE		(1 << 4)
/** DFSDM_FLT2CR2_ROVRIE Regular data overrun interrupt enable **/
#define DFSDM_FLT2CR2_ROVRIE		(1 << 3)
/** DFSDM_FLT2CR2_JOVRIE Injected data overrun interrupt enable **/
#define DFSDM_FLT2CR2_JOVRIE		(1 << 2)
/** DFSDM_FLT2CR2_REOCIE Regular end of conversion interrupt enable **/
#define DFSDM_FLT2CR2_REOCIE		(1 << 1)
/** DFSDM_FLT2CR2_JEOCIE Injected end of conversion interrupt enable **/
#define DFSDM_FLT2CR2_JEOCIE		(1 << 0)

/**@}*/

/** @defgroup dfsdm_flt2isr FLT2ISR interrupt and status register
@{*/


#define DFSDM_FLT2ISR_SCDF_SHIFT		24
#define DFSDM_FLT2ISR_SCDF_MASK		0xff
/** @defgroup dfsdm_flt2isr_scdf SCDF short-circuit detector flag
@{*/
/**@}*/


#define DFSDM_FLT2ISR_CKABF_SHIFT		16
#define DFSDM_FLT2ISR_CKABF_MASK		0xff
/** @defgroup dfsdm_flt2isr_ckabf CKABF Clock absence flag
@{*/
/**@}*/

/** DFSDM_FLT2ISR_RCIP Regular conversion in progress status **/
#define DFSDM_FLT2ISR_RCIP		(1 << 14)
/** DFSDM_FLT2ISR_JCIP Injected conversion in progress status **/
#define DFSDM_FLT2ISR_JCIP		(1 << 13)
/** DFSDM_FLT2ISR_AWDF Analog watchdog **/
#define DFSDM_FLT2ISR_AWDF		(1 << 4)
/** DFSDM_FLT2ISR_ROVRF Regular conversion overrun flag **/
#define DFSDM_FLT2ISR_ROVRF		(1 << 3)
/** DFSDM_FLT2ISR_JOVRF Injected conversion overrun flag **/
#define DFSDM_FLT2ISR_JOVRF		(1 << 2)
/** DFSDM_FLT2ISR_REOCF End of regular conversion flag **/
#define DFSDM_FLT2ISR_REOCF		(1 << 1)
/** DFSDM_FLT2ISR_JEOCF End of injected conversion flag **/
#define DFSDM_FLT2ISR_JEOCF		(1 << 0)

/**@}*/

/** @defgroup dfsdm_flt2icr FLT2ICR interrupt flag clear register
@{*/


#define DFSDM_FLT2ICR_CLRSCDF_SHIFT		24
#define DFSDM_FLT2ICR_CLRSCDF_MASK		0xff
/** @defgroup dfsdm_flt2icr_clrscdf CLRSCDF Clear the short-circuit detector flag
@{*/
/**@}*/


#define DFSDM_FLT2ICR_CLRCKABF_SHIFT		16
#define DFSDM_FLT2ICR_CLRCKABF_MASK		0xff
/** @defgroup dfsdm_flt2icr_clrckabf CLRCKABF Clear the clock absence flag
@{*/
/**@}*/

/** DFSDM_FLT2ICR_CLRROVRF Clear the regular conversion overrun flag **/
#define DFSDM_FLT2ICR_CLRROVRF		(1 << 3)
/** DFSDM_FLT2ICR_CLRJOVRF Clear the injected conversion overrun flag **/
#define DFSDM_FLT2ICR_CLRJOVRF		(1 << 2)

/**@}*/

/** @defgroup dfsdm_flt2jchgr FLT2JCHGR injected channel group selection register
@{*/


#define DFSDM_FLT2JCHGR_JCHG_SHIFT		0
#define DFSDM_FLT2JCHGR_JCHG_MASK		0xff
/** @defgroup dfsdm_flt2jchgr_jchg JCHG Injected channel group selection
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_flt2fcr FLT2FCR filter control register
@{*/


#define DFSDM_FLT2FCR_FORD_SHIFT		29
#define DFSDM_FLT2FCR_FORD_MASK		0x07
/** @defgroup dfsdm_flt2fcr_ford FORD Sinc filter order
@{*/
/**@}*/


#define DFSDM_FLT2FCR_FOSR_SHIFT		16
#define DFSDM_FLT2FCR_FOSR_MASK		0x3ff
/** @defgroup dfsdm_flt2fcr_fosr FOSR Sinc filter oversampling ratio (decimation rate)
@{*/
/**@}*/


#define DFSDM_FLT2FCR_IOSR_SHIFT		0
#define DFSDM_FLT2FCR_IOSR_MASK		0xff
/** @defgroup dfsdm_flt2fcr_iosr IOSR Integrator oversampling ratio (averaging length)
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_flt2jdatar FLT2JDATAR data register for injected group
@{*/


#define DFSDM_FLT2JDATAR_JDATA_SHIFT		8
#define DFSDM_FLT2JDATAR_JDATA_MASK		0xffffff
/** @defgroup dfsdm_flt2jdatar_jdata JDATA Injected group conversion data
@{*/
/**@}*/


#define DFSDM_FLT2JDATAR_JDATACH_SHIFT		0
#define DFSDM_FLT2JDATAR_JDATACH_MASK		0x07
/** @defgroup dfsdm_flt2jdatar_jdatach JDATACH Injected channel most recently converted
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_flt2rdatar FLT2RDATAR data register for the regular channel
@{*/


#define DFSDM_FLT2RDATAR_RDATA_SHIFT		8
#define DFSDM_FLT2RDATAR_RDATA_MASK		0xffffff
/** @defgroup dfsdm_flt2rdatar_rdata RDATA Regular channel conversion data
@{*/
/**@}*/

/** DFSDM_FLT2RDATAR_RPEND Regular channel pending data **/
#define DFSDM_FLT2RDATAR_RPEND		(1 << 4)

#define DFSDM_FLT2RDATAR_RDATACH_SHIFT		0
#define DFSDM_FLT2RDATAR_RDATACH_MASK		0x07
/** @defgroup dfsdm_flt2rdatar_rdatach RDATACH Regular channel most recently converted
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_flt2awhtr FLT2AWHTR analog watchdog high threshold register
@{*/


#define DFSDM_FLT2AWHTR_AWHT_SHIFT		8
#define DFSDM_FLT2AWHTR_AWHT_MASK		0xffffff
/** @defgroup dfsdm_flt2awhtr_awht AWHT Analog watchdog high threshold
@{*/
/**@}*/


#define DFSDM_FLT2AWHTR_BKAWH_SHIFT		0
#define DFSDM_FLT2AWHTR_BKAWH_MASK		0x0f
/** @defgroup dfsdm_flt2awhtr_bkawh BKAWH Break signal assignment to analog watchdog high threshold event
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_flt2awltr FLT2AWLTR analog watchdog low threshold register
@{*/


#define DFSDM_FLT2AWLTR_AWLT_SHIFT		8
#define DFSDM_FLT2AWLTR_AWLT_MASK		0xffffff
/** @defgroup dfsdm_flt2awltr_awlt AWLT Analog watchdog low threshold
@{*/
/**@}*/


