grevaillot/svd_tools/headers/STM32H7x7_CM4/dfsdm.h
/** @defgroup dfsdm_flt3jchgr FLT3JCHGR injected channel group selection register
@{*/


#define DFSDM_FLT3JCHGR_JCHG_SHIFT		0
#define DFSDM_FLT3JCHGR_JCHG_MASK		0xff
/** @defgroup dfsdm_flt3jchgr_jchg JCHG Injected channel group selection
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_flt3fcr FLT3FCR filter control register
@{*/


#define DFSDM_FLT3FCR_FORD_SHIFT		29
#define DFSDM_FLT3FCR_FORD_MASK		0x07
/** @defgroup dfsdm_flt3fcr_ford FORD Sinc filter order
@{*/
/**@}*/


#define DFSDM_FLT3FCR_FOSR_SHIFT		16
#define DFSDM_FLT3FCR_FOSR_MASK		0x3ff
/** @defgroup dfsdm_flt3fcr_fosr FOSR Sinc filter oversampling ratio (decimation rate)
@{*/
/**@}*/


#define DFSDM_FLT3FCR_IOSR_SHIFT		0
#define DFSDM_FLT3FCR_IOSR_MASK		0xff
/** @defgroup dfsdm_flt3fcr_iosr IOSR Integrator oversampling ratio (averaging length)
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_flt3jdatar FLT3JDATAR data register for injected group
@{*/


#define DFSDM_FLT3JDATAR_JDATA_SHIFT		8
#define DFSDM_FLT3JDATAR_JDATA_MASK		0xffffff
/** @defgroup dfsdm_flt3jdatar_jdata JDATA Injected group conversion data
@{*/
/**@}*/


#define DFSDM_FLT3JDATAR_JDATACH_SHIFT		0
#define DFSDM_FLT3JDATAR_JDATACH_MASK		0x07
/** @defgroup dfsdm_flt3jdatar_jdatach JDATACH Injected channel most recently converted
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_flt3rdatar FLT3RDATAR data register for the regular channel
@{*/


#define DFSDM_FLT3RDATAR_RDATA_SHIFT		8
#define DFSDM_FLT3RDATAR_RDATA_MASK		0xffffff
/** @defgroup dfsdm_flt3rdatar_rdata RDATA Regular channel conversion data
@{*/
/**@}*/

/** DFSDM_FLT3RDATAR_RPEND Regular channel pending data **/
#define DFSDM_FLT3RDATAR_RPEND		(1 << 4)

#define DFSDM_FLT3RDATAR_RDATACH_SHIFT		0
#define DFSDM_FLT3RDATAR_RDATACH_MASK		0x07
/** @defgroup dfsdm_flt3rdatar_rdatach RDATACH Regular channel most recently converted
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_flt3awhtr FLT3AWHTR analog watchdog high threshold register
@{*/


#define DFSDM_FLT3AWHTR_AWHT_SHIFT		8
#define DFSDM_FLT3AWHTR_AWHT_MASK		0xffffff
/** @defgroup dfsdm_flt3awhtr_awht AWHT Analog watchdog high threshold
@{*/
/**@}*/


#define DFSDM_FLT3AWHTR_BKAWH_SHIFT		0
#define DFSDM_FLT3AWHTR_BKAWH_MASK		0x0f
/** @defgroup dfsdm_flt3awhtr_bkawh BKAWH Break signal assignment to analog watchdog high threshold event
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_flt3awltr FLT3AWLTR analog watchdog low threshold register
@{*/


#define DFSDM_FLT3AWLTR_AWLT_SHIFT		8
#define DFSDM_FLT3AWLTR_AWLT_MASK		0xffffff
/** @defgroup dfsdm_flt3awltr_awlt AWLT Analog watchdog low threshold
@{*/
/**@}*/


#define DFSDM_FLT3AWLTR_BKAWL_SHIFT		0
#define DFSDM_FLT3AWLTR_BKAWL_MASK		0x0f
/** @defgroup dfsdm_flt3awltr_bkawl BKAWL Break signal assignment to analog watchdog low threshold event
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_flt3awsr FLT3AWSR analog watchdog status register
@{*/


#define DFSDM_FLT3AWSR_AWHTF_SHIFT		8
#define DFSDM_FLT3AWSR_AWHTF_MASK		0xff
/** @defgroup dfsdm_flt3awsr_awhtf AWHTF Analog watchdog high threshold flag
@{*/
/**@}*/


#define DFSDM_FLT3AWSR_AWLTF_SHIFT		0
#define DFSDM_FLT3AWSR_AWLTF_MASK		0xff
/** @defgroup dfsdm_flt3awsr_awltf AWLTF Analog watchdog low threshold flag
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_flt3awcfr FLT3AWCFR analog watchdog clear flag register
@{*/


#define DFSDM_FLT3AWCFR_CLRAWHTF_SHIFT		8
#define DFSDM_FLT3AWCFR_CLRAWHTF_MASK		0xff
/** @defgroup dfsdm_flt3awcfr_clrawhtf CLRAWHTF Clear the analog watchdog high threshold flag
@{*/
/**@}*/


#define DFSDM_FLT3AWCFR_CLRAWLTF_SHIFT		0
#define DFSDM_FLT3AWCFR_CLRAWLTF_MASK		0xff
/** @defgroup dfsdm_flt3awcfr_clrawltf CLRAWLTF Clear the analog watchdog low threshold flag
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_flt3exmax FLT3EXMAX Extremes detector maximum register
@{*/


#define DFSDM_FLT3EXMAX_EXMAX_SHIFT		8
#define DFSDM_FLT3EXMAX_EXMAX_MASK		0xffffff
/** @defgroup dfsdm_flt3exmax_exmax EXMAX Extremes detector maximum value
@{*/
/**@}*/


#define DFSDM_FLT3EXMAX_EXMAXCH_SHIFT		0
#define DFSDM_FLT3EXMAX_EXMAXCH_MASK		0x07
/** @defgroup dfsdm_flt3exmax_exmaxch EXMAXCH Extremes detector maximum data channel
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_flt3exmin FLT3EXMIN Extremes detector minimum register
@{*/


#define DFSDM_FLT3EXMIN_EXMIN_SHIFT		8
#define DFSDM_FLT3EXMIN_EXMIN_MASK		0xffffff
/** @defgroup dfsdm_flt3exmin_exmin EXMIN EXMIN
@{*/
/**@}*/


#define DFSDM_FLT3EXMIN_EXMINCH_SHIFT		0
#define DFSDM_FLT3EXMIN_EXMINCH_MASK		0x07
/** @defgroup dfsdm_flt3exmin_exminch EXMINCH Extremes detector minimum data channel
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_flt3cnvtimr FLT3CNVTIMR conversion timer register
@{*/


#define DFSDM_FLT3CNVTIMR_CNVCNT_SHIFT		4
#define DFSDM_FLT3CNVTIMR_CNVCNT_MASK		0xfffffff
/** @defgroup dfsdm_flt3cnvtimr_cnvcnt CNVCNT 28-bit timer counting conversion time t = CNVCNT[27:0] / fDFSDM_CKIN
@{*/
/**@}*/


/**@}*/
